//============================================================================================
//	Spirenkov Maxim aka Sp-Max Shaman, 2001
//--------------------------------------------------------------------------------------------
//	
//--------------------------------------------------------------------------------------------
//	CharacterAnimationKipper
//--------------------------------------------------------------------------------------------
//	
//============================================================================================

#ifndef _CharacterAnimationKipper_H_
#define _CharacterAnimationKipper_H_


#include "..\common_h\vmodule_api.h"
#include "..\common_h\animation.h"

class VDX9RENDER;

class CharacterAnimationKipper : public ENTITY
{
//--------------------------------------------------------------------------------------------
//Конструирование, деструктурирование
//--------------------------------------------------------------------------------------------
public:
	CharacterAnimationKipper();
	virtual ~CharacterAnimationKipper();

	//Инициализация
	bool Init();
	void LockTexture(const char * texture);

//--------------------------------------------------------------------------------------------
//Инкапсуляция
//--------------------------------------------------------------------------------------------
private:
	VDX9RENDER * rs;

	AnimationService * asr;
	Animation * aniMan;
	Animation * aniWoman;

	long lockTextures[16];
	long numLTextures;
};

#endif

