//============================================================================================
//	Spirenkov Maxim
//--------------------------------------------------------------------------------------------
//	
//--------------------------------------------------------------------------------------------
//	Lizards
//--------------------------------------------------------------------------------------------
//	
//============================================================================================

#ifndef _Lizards_h_
#define _Lizards_h_


#include "../Common_h/vmodule_api.h"
#include "../Common_h/dx9render.h"

#include "Lizard.h"


class Lizards : public ENTITY
{
public:
	Lizards();
	virtual ~Lizards();

	//Инициализация
	bool Init();
	//Исполнение
	void Execute(uint32_t delta_time);
	//Рисование
	void Realize(uint32_t delta_time);


	Lizard lizard[8];
	long num;
};

#endif

