//============================================================================================
//	Spirenkov Maxim, 2003
//--------------------------------------------------------------------------------------------
//	
//--------------------------------------------------------------------------------------------
//	LocRats
//--------------------------------------------------------------------------------------------
//	
//============================================================================================

#ifndef _LocRats_h_
#define _LocRats_h_

#include "..\common_h\vmodule_api.h"
#include "..\common_h\dx9render.h"

#include "LocRat.h"


class LocRats : public ENTITY  
{
public:
	LocRats();
	virtual ~LocRats();

//--------------------------------------------------------------------------------------------
public:
	//Инициализация
	bool Init();
	//Исполнение
	void Execute(uint32_t delta_time);
	//Рисование
	void Realize(uint32_t delta_time);

	//Сообщения
	uint32_t _cdecl ProcessMessage(MESSAGE & message);

//--------------------------------------------------------------------------------------------
private:
	LocRat rat[32];
	long num;
};

#endif

