//============================================================================================
//	Spirenkov Maxim aka Sp-Max Shaman, 2001
//--------------------------------------------------------------------------------------------
//	
//--------------------------------------------------------------------------------------------
//	WideScreen
//--------------------------------------------------------------------------------------------
//	
//============================================================================================

#ifndef _WideScreen_H_
#define _WideScreen_H_

#include "..\common_h\vmodule_api.h"
#include "..\common_h\dx9render.h"

class WideScreen : public ENTITY  
{
//--------------------------------------------------------------------------------------------
//Конструирование, деструктурирование
//--------------------------------------------------------------------------------------------
public:
	WideScreen();
	virtual ~WideScreen();

	//Инициализация
	bool Init();
	//Сообщения
	uint32_t _cdecl ProcessMessage(MESSAGE & message);
	//Работа
	void Realize(uint32_t delta_time);

//--------------------------------------------------------------------------------------------
//Инкапсуляция
//--------------------------------------------------------------------------------------------
private:
	VDX9RENDER * rs;	//
	float w, h;			//Размеры экрана
	float state;		//Состояние экрана
	float dlt;			//Направление изменения экрана
};

#endif

